In [4]:
print("Projeto de pandas para analise de vendas")
print("Criaçao de um relatorio que tem segmento por gerente e qual tendencia das vendas")

Projeto de pandas para analise de vendas
Criaçao de um relatorio que tem segmento por gerente e qual tendencia das vendas

In [5]:
import pandas as pd
import numpy as np

In [38]:
df_vendas = pd.read_csv('Data\\vendas_tech.csv', low_memory=False)
display(df_vendas)

df_gerentes = pd.read_excel('Data\\gerentes_lojas.xlsx')
display(df_gerentes)

,ID_Pedido,Data,Loja,Produto,Preco_Unitario,Qtd,Cliente,Data_Base
0,1,2023-06-08,São Paulo,Mouse Gamer,120.0,1,Cliente_4095,2025-01-01
1,2,2023-03-01,Belo Horizonte,iPhone 14,5500.0,1,Cliente_8750,NaN
2,3,2023-02-25,NaN,"Monitor 27""",1200.0,1,Cliente_14859,NaN
3,4,2024-11-19,RIO DE JANEIRO,Mouse Gamer,120.0,2,Cliente_17343,NaN
4,5,2024-01-27,Rio de Janeiro,Smartphone Samsung,2200.0,1,Cliente_23377,NaN
...,...,...,...,...,...,...,...,...
100095,94091,2023-10-20,Porto Alegre,iPhone 14,5500.0,1,Cliente_11755,NaN
100096,52883,2024-03-17,Porto Alegre,Notebook Dell,3500.0,2,Cliente_12879,NaN
100097,65070,2023-06-19,Belo Horizonte,Smartphone Samsung,2200.0,2,Cliente_8160,NaN
100098,94031,2024-06-14,Salvador,iPhone 14,5500.0,2,Cliente_28545,NaN
100099,36755,2023-01-03,São Paulo,Notebook HP,3200.0,2,Cliente_3274,NaN

             Loja   Gerente  Meta_Mensal
0       São Paulo    Carlos        50000
1  Rio de Janeiro  Fernanda        60000
2        Curitiba   Roberto        45000
3  Belo Horizonte   Juliana        55000
4          Recife    Marcos        48000
5    Porto Alegre     Pedro        42000
6        Salvador       Ana        52000

In [12]:
#Inpeçao 
#display(df_vendas.head(15))
#display(df_vendas.tail(15))
display(df_vendas.sample(15))#Amostra

,ID_Pedido,Data,Loja,Produto,Preco_Unitario,Qtd,Cliente,Data_Base
34718,34719,2024-12-13,Belo Horizonte,Notebook Dell,3500.0,1,Cliente_14535,NaN
48311,48312,2023-04-14,Rio de Janeiro,Smartphone Samsung,2200.0,2,Cliente_18155,NaN
2253,2254,2023-06-19,São Paulo,Notebook HP,3200.0,1,Cliente_18450,NaN
47020,47021,2023-05-12,NaN,Smartphone Samsung,2200.0,2,Cliente_19513,NaN
8811,8812,2024-02-07,NaN,"Monitor 27""",1200.0,1,Cliente_7594,NaN
97286,97287,2023-05-07,Salvador,Mouse Gamer,120.0,5,Cliente_28940,NaN
53249,53250,2024-01-07,Salvador,Teclado Mecânico,250.0,1,Cliente_1158,NaN
65912,65913,2023-12-10,Porto Alegre,Cabo HDMI,40.0,2,Cliente_1204,NaN
93954,93955,2023-10-31,Salvador,"Monitor 27""",1200.0,1,Cliente_25476,NaN
1604,1605,2024-10-09,Belo Horizonte,iPhone 14,5500.0,2,Cliente_4366,NaN
22935,22936,2024-01-04,Rio de Janeiro,Notebook HP,3200.0,1,Cliente_10399,NaN
65004,65005,2023-11-11,Porto Alegre,iPhone 14,5500.0,3,Cliente_1680,NaN
30175,30176,2024-01-02,Salvador,Smartphone Samsung,2200.0,1,Cliente_460,NaN
50738,50739,2023-01-09,Recife,Teclado Mecânico,250.0,1,Cliente_27605,NaN
3821,3822,2023-11-15,Curitiba,Teclado Mecânico,250.0,5,Cliente_20537,NaN

In [15]:
display(df_vendas.shape)
display(df_vendas.columns)

(100100, 8)

Index(['ID_Pedido', 'Data', 'Loja', 'Produto', 'Preco_Unitario', 'Qtd',
       'Cliente', 'Data_Base'],
      dtype='object')

In [23]:
display(df_vendas.info())
display(df_vendas.describe())
display(df_vendas.columns)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100100 entries, 0 to 100099
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ID_Pedido       100100 non-null  int64
 1   Data            100100 non-null  object
 2   Loja            98099 non-null   object
 3   Produto         100100 non-null  object
 4   Preco_Unitario  100100 non-null  float64
 5   Qtd             100100 non-null  int64
 6   Cliente         100100 non-null  object
 7   Data_Base       1 non-null       object
dtypes: float64(1), int64(2), object(5)
memory usage: 6.1+ MB

None

           ID_Pedido  Preco_Unitario            Qtd
count  100100.000000   100100.000000  100100.000000
mean    50004.810180     2000.204595       1.499101
std     28866.872543     1841.050733       1.241605
min         1.000000       40.000000       1.000000
25%     25008.750000      120.000000       1.000000
50%     50004.500000     1200.000000       1.000000
75%     75002.250000     3200.000000       1.000000
max    100000.000000     5500.000000      10.000000

Index(['ID_Pedido', 'Data', 'Loja', 'Produto', 'Preco_Unitario', 'Qtd',
       'Cliente', 'Data_Base'],
      dtype='object')

In [28]:
# Seleçao de colunas
df_vendas['Loja']
df_vendas[['Loja', 'Cliente']]

                  Loja        Cliente
0            São Paulo   Cliente_4095
1       Belo Horizonte   Cliente_8750
2                  NaN  Cliente_14859
3       RIO DE JANEIRO  Cliente_17343
4       Rio de Janeiro  Cliente_23377
...                ...            ...
100095    Porto Alegre  Cliente_11755
100096    Porto Alegre  Cliente_12879
100097  Belo Horizonte   Cliente_8160
100098        Salvador  Cliente_28545
100099      São Paulo    Cliente_3274

[100100 rows x 2 columns]

In [39]:
#Colunas
df_analise = df_vendas.drop(columns=['Data_Base'])

In [40]:
display(df_analise.head(5))
display(df_analise.columns)

,ID_Pedido,Data,Loja,Produto,Preco_Unitario,Qtd,Cliente
0,1,2023-06-08,São Paulo,Mouse Gamer,120.0,1,Cliente_4095
1,2,2023-03-01,Belo Horizonte,iPhone 14,5500.0,1,Cliente_8750
2,3,2023-02-25,NaN,"Monitor 27""",1200.0,1,Cliente_14859
3,4,2024-11-19,RIO DE JANEIRO,Mouse Gamer,120.0,2,Cliente_17343
4,5,2024-01-27,Rio de Janeiro,Smartphone Samsung,2200.0,1,Cliente_23377

Index(['ID_Pedido', 'Data', 'Loja', 'Produto', 'Preco_Unitario', 'Qtd',
       'Cliente'],
      dtype='object')

In [41]:
#Nulos
#dropna() mas ele exclui tudo 

df_analise['Loja'] = df_analise['Loja'].fillna("Loja Online")

In [44]:
df_analise.info()
display(df_analise['Loja'])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100100 entries, 0 to 100099
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ID_Pedido       100100 non-null  int64
 1   Data            100100 non-null  object
 2   Loja            100100 non-null  object
 3   Produto         100100 non-null  object
 4   Preco_Unitario  100100 non-null  float64
 5   Qtd             100100 non-null  int64
 6   Cliente         100100 non-null  object
dtypes: float64(1), int64(2), object(4)
memory usage: 5.3+ MB

0              São Paulo
1         Belo Horizonte
2            Loja Online
3         RIO DE JANEIRO
4         Rio de Janeiro
               ...
100095      Porto Alegre
100096      Porto Alegre
100097    Belo Horizonte
100098          Salvador
100099        São Paulo
Name: Loja, Length: 100100, dtype: object

In [46]:
#Tipos de dados
df_analise['Data'] = pd.to_datetime(df_analise['Data'], format="%Y-%m-%d")

In [53]:
#Padronizaçao de capitalize

df_analise['Loja'] = df_analise['Loja'].str.title() # deixa primeira letra de cada em caixa alta
df_analise['Loja'] = df_analise['Loja'].str.strip() # Trimm

df_analise['Produto'] = df_analise['Produto'].str.title() 
df_analise['Produto'] = df_analise['Produto'].str.strip()

df_analise['Cliente'] = df_analise['Cliente'].str.capitalize() 
df_analise['Cliente'] = df_analise['Cliente'].str.strip()
display(df_analise.head(5))

,ID_Pedido,Data,Loja,Produto,Preco_Unitario,Qtd,Cliente
0,1,2023-06-08,São Paulo,Mouse Gamer,120.0,1,Cliente_4095
1,2,2023-03-01,Belo Horizonte,Iphone 14,5500.0,1,Cliente_8750
2,3,2023-02-25,Loja Online,"Monitor 27""",1200.0,1,Cliente_14859
3,4,2024-11-19,Rio De Janeiro,Mouse Gamer,120.0,2,Cliente_17343
4,5,2024-01-27,Rio De Janeiro,Smartphone Samsung,2200.0,1,Cliente_23377

In [55]:
#Duplicatas
#subset seleciona uma lista de colunas 
#Keep se tiver 2 iguais remove o ultimo last ou first

df_analise = df_analise.drop_duplicates(subset=["ID_Pedido"])

In [56]:
display(df_analise.info())

<class 'pandas.core.frame.DataFrame'>
Index: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ID_Pedido       100000 non-null  int64
 1   Data            100000 non-null  datetime64[ns]
 2   Loja            100000 non-null  object
 3   Produto         100000 non-null  object
 4   Preco_Unitario  100000 non-null  float64
 5   Qtd             100000 non-null  int64
 6   Cliente         100000 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 6.1+ MB

None

In [ ]:
# https://youtu.be/TMfMkgLkeBQ?t=3248